app/controllers/addresses_controller.rb

  def create
    @address = Address.new(address_params)

    if @address.save
---
INSERT INTO "addresses" ("line1", "line2", "zip", "stateCode", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["line1", "4 perry st"], ["line2", "kentown"], ["zip", 12345], ["stateCode", "NY"], ["created_at", "2017-11-28 13:36:41.708128"], ["updated_at", "2017-11-28 13:36:41.708128"]]