app/controllers/contacts_controller.rb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."contact_id" = $1 LIMIT $2  [["contact_id", 1], ["LIMIT", 1]]
---
  def show
    address = Address.find_by_contact_id(@contact.id)